from numpy_financial import irr
class YYFX:

    # 偏差率=(实际-预估)/预估*100% 保留两位小数
    def deviation_rate(self):
        self.a = float(input("实际发电量："))
        self.b = float(input("预测发电量："))
        print("偏差率：", round((self.a - self.b) / self.b * 100, 2), "%")

    # 计算IRR
    def irr_result(self):
        # 定义现金流-101.6	0.0	15.9	16.9	15.5	15.9	11.0	9.1	9.9	10.8	11.7	36.3	36.1	35.9	35.7	35.5	35.3	35.1	34.9	34.8	34.6	30.7	30.5	30.3	30.1	42.2

        # cash_flows = [
        #     -101.6, 0.0, 15.9, 16.9, 15.5, 15.9, 11.0, 9.1, 9.9, 10.8,
        #     11.7, 36.3, 36.1, 35.9, 35.7, 35.5, 35.3, 35.1, 34.9, 34.8,
        #     34.6, 30.7, 30.5, 30.3, 30.1, 42.2
        # ]
        cash_flows = [
            0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
        ]

        # cash_flows = [-331.9, 38.0, 52.5, 52.0, 47.8, 47.0, 40.9, 37.0, 36.8, 36.6, 36.4, 36.2, 36.0, 35.8, 35.6, 35.4,
        #               35.2, 35.1, 34.9, 34.7, 34.5, 30.7, 30.5, 30.3, 30.1, 42.2]

        # 计算IRR
        irr_result = irr(cash_flows)

        print(f"The Internal Rate of Return (IRR) is: {irr_result:.2%}")
if __name__ == '__main__':
    YYFX().irr_result()
